MyWeather/src/DataProcessors/Weather/Weather.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Weather</name>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяТемпература</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>min</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>max</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаДанных</name>
    <attributes>
      <name>КолонкаОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колонка0</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колонка1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колонка2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колонка3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колонка4</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колонка5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колонка6</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колонка7</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

MyWeather/src/DataProcessors/Weather/ObjectModule.bsl
Функция ПолучитьДанныеОПогоде(Город, Дата, ПроизошлаОшибка, ТекстОшибки) Экспорт 

	Соединение=Новый HTTPСоединение("sinoptik.com.ru", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);
	ТекстЗапроса = ПолучитьТекстЗапроса(Город, Дата);
	Запрос = Новый HTTPЗапрос(ТекстЗапроса);
	Ответ = Соединение.Получить(Запрос);

	МассивФильтров = ОбщегоНазначенияСервер.СформироватьМассивФильтров();
	
	Если Ответ.КодСостояния = 200 Тогда

		СтрокаHTML = Ответ.ПолучитьТелоКакСтроку();

		Чтение = Новый ЧтениеHTML;
		Чтение.УстановитьСтроку(СтрокаHTML);
		Построитель = Новый ПостроительDOM;

		ДокHTML = Построитель.Прочитать(Чтение);
		ДокHTML.НормализоватьДокумент();

		МассивУзловТекТемпература = ДокHTML.НайтиПоФильтру(МассивФильтров[0]);
		Если Не МассивУзловТекТемпература = Неопределено И МассивУзловТекТемпература.Количество() > 0 Тогда
			ТекущаяТемпература = СокрЛП(МассивУзловТекТемпература[0].ТекстовоеСодержимое);
		КонецЕсли;

		МассивУзловТекОписание = ДокHTML.НайтиПоФильтру(МассивФильтров[1]);
		Если Не МассивУзловТекОписание = Неопределено И МассивУзловТекОписание.Количество() > 0 Тогда
			Описание = СокрЛП(МассивУзловТекОписание[0].ТекстовоеСодержимое);
		КонецЕсли;

		МассивУзловТаблицаТемператур  = ДокHTML.НайтиПоФильтру(МассивФильтров[2]);
		МассивУзловТаблицаЧувствуется = ДокHTML.НайтиПоФильтру(МассивФильтров[3]);
		МассивУзловТаблицаВетер       = ДокHTML.НайтиПоФильтру(МассивФильтров[4]);

		СтруктураВозвращаемыхДанных = Новый Структура("Температура,Ощущается,Ветер");
		Если Не МассивУзловТаблицаТемператур = Неопределено И МассивУзловТаблицаТемператур.Количество() > 0 Тогда
			СтруктураВозвращаемыхДанных.Температура = ПеренестиДанныеВМассив(МассивУзловТаблицаТемператур);
		КонецЕсли;

		Если Не МассивУзловТаблицаЧувствуется = Неопределено И МассивУзловТаблицаЧувствуется.Количество() > 0 Тогда
			СтруктураВозвращаемыхДанных.Ощущается = ПеренестиДанныеВМассив(МассивУзловТаблицаЧувствуется);
		КонецЕсли;

		Если Не МассивУзловТаблицаВетер = Неопределено И МассивУзловТаблицаВетер.Количество() > 0 Тогда
			СтруктураВозвращаемыхДанных.Ветер = ПеренестиДанныеВМассив(МассивУзловТаблицаВетер,Истина);
		КонецЕсли;

	ИначеЕсли Ответ.КодСостояния = 404 Тогда
		ПроизошлаОшибка = Истина;
		ТекстОшибки = "Указнный город не найден";
	Иначе
		ПроизошлаОшибка = Истина;
		ТекстОшибки =  "Не удалось установить соединение";
	КонецЕсли;

	Возврат СтруктураВозвращаемыхДанных;
КонецФункции

Функция ПолучитьТекстЗапроса(Город, Дата)
	Возврат ?(ЭтоСегодняшняяДата(Дата), СтрШаблон("/погода-%1", Город), СтрШаблон("/погода-%1/%2", Город, Формат(Дата,
		"ДФ=yyyy-MM-dd;")));

КонецФункции

Функция ЭтоСегодняшняяДата(Дата)
	Возврат НачалоДня(Дата) = НачалоДня(ТекущаяДата());
КонецФункции

Функция ПеренестиДанныеВМассив(МассивВходящихДанных,НужнаДопОбработкаПредставления = Ложь)

	ВложенныйМассив = Новый Массив;
	Для Каждого тСтрока Из МассивВходящихДанных Цикл
		
		Если НужнаДопОбработкаПредставления Тогда
			
			МассивПредставлений = СтрРазделить(СокрП(тСтрока.ТекстовоеСодержимое),Символы.ПС);
			ТекстовоеСодержимое = МассивПредставлений[МассивПредставлений.ВГраница()];
			
		Иначе
			ТекстовоеСодержимое = СокрЛП(тСтрока.ТекстовоеСодержимое);
		КонецЕсли;
		ВложенныйМассив.Добавить(ТекстовоеСодержимое);
		
	КонецЦикла;

	Возврат ВложенныйМассив;

КонецФункции
